Repository: xcv58/MacTools
Catalog: Plugins/DiskClean/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# limitation.scanRootUnreadable
source: 无法读取 %@（%@）
ar: تعذّرت قراءة %@ (%@)
de: %@ konnte nicht gelesen werden (%@)
en: Couldn’t read %@ (%@)
es: No se pudo leer %@ (%@)
fr: Impossible de lire %@ (%@)
ja: %@ を読み取れません（%@）
ko: %@를 읽을 수 없음(%@)
pt: Não foi possível ler %@ (%@)
ru: Не удалось прочитать %@ (%@)
tr: %@ okunamadı (%@)
zh_hant: 無法讀取 %@（%@）

# limitation.scanRootDenied
source: 没有访问 %@ 的权限，其中的内容未被扫描
ar: لا إذن للوصول إلى %@؛ لم يُمسح محتواه
de: Kein Zugriff auf %@; Inhalt wurde nicht gescannt
en: No permission to access %@; its contents were not scanned
es: Sin permiso para acceder a %@; no se escaneó su contenido
fr: Pas d’autorisation pour accéder à %@ ; son contenu n’a pas été analysé
ja: %@ にアクセスする権限がなく、内容はスキャンされませんでした
ko: %@에 대한 권한이 없어 내용이 스캔되지 않았습니다
pt: Sem permissão para aceder a %@; o conteúdo não foi analisado
ru: Нет доступа к %@; содержимое не сканировалось
tr: %@ için erişim izni yok; içindekiler taranmadı
zh_hant: 沒有訪問 %@ 的權限，其中的內容未被掃描

# limitation.walkerCircuitBroken
source: 扫描引擎已降级，本次不再计算大小，重启应用后恢复
ar: محرك المسح متراجع؛ لن تُحسب الأحجام هذه المرة. أعد تشغيل التطبيق للاستعادة.
de: Scan-Engine im Notbetrieb; Größen werden diesmal nicht berechnet. App neu starten zum Wiederherstellen.
en: Scan engine degraded; sizes won’t be calculated this run. Restart the app to recover.
es: Motor de escaneo degradado; no se calcularán tamaños en esta ejecución. Reinicia la app para recuperarlo.
fr: Moteur d’analyse dégradé ; les tailles ne seront pas calculées cette fois. Redémarrez l’app pour rétablir.
ja: スキャンエンジンが縮退動作中です。今回はサイズ計算を行いません。アプリを再起動すると復旧します。
ko: 스캔 엔진이 저하되었습니다. 이번 실행에서는 크기를 계산하지 않습니다. 앱을 재시작하면 복구됩니다.
pt: Motor de varredura degradado; tamanhos não serão calculados desta vez. Reinicie a app para recuperar.
ru: Движок сканирования в урезанном режиме; размеры в этот раз не считаются. Перезапустите приложение.
tr: Tarama motoru düşük performans modunda; bu çalıştırmada boyutlar hesaplanmayacak. Düzelmek için uygulamayı yeniden başlatın.
zh_hant: 掃描引擎已降級，本次不再計算大小，重啟應用後恢復

# limitation.threadsAbandoned
source: 有 %d 个扫描线程未能按时返回
ar: %d من خيوط المسح لم تُرجع في الوقت
de: %d Scan-Threads kamen nicht rechtzeitig zurück
en: %d scan threads didn’t return in time
es: %d hilos de escaneo no respondieron a tiempo
fr: %d fils d’analyse n’ont pas répondu à temps
ja: %d 個のスキャンスレッドが時間内に戻りませんでした
ko: 스캔 스레드 %d개가 제때 반환되지 않음
pt: %d threads de varredura não responderam a tempo
ru: %d потоков сканирования не вернулись вовремя
tr: %d tarama iş parçacığı zamanında dönmedi
zh_hant: 有 %d 個掃描線程未能按時返回

# detail.result.partiallyDeleted
source: 只删除了一部分
ar: حُذف جزئياً فقط
de: Nur teilweise gelöscht
en: Only partly deleted
es: Eliminado solo en parte
fr: Supprimé en partie seulement
ja: 一部のみ削除
ko: 일부만 삭제됨
pt: Excluído apenas em parte
ru: Удалено лишь частично
tr: Yalnızca kısmen silindi
zh_hant: 只刪除了一部分

# detail.result.rollbackBlocked
source: 无法放回原处
ar: تعذّر الإرجاع إلى الموقع الأصلي
de: Wiederherstellung am Ursprungspfad blockiert
en: Couldn’t restore to original location
es: No se pudo restaurar a la ubicación original
fr: Impossible de restaurer à l’emplacement d’origine
ja: 元の場所に戻せません
ko: 원래 위치로 되돌릴 수 없음
pt: Não foi possível restaurar ao local original
ru: Не удалось вернуть на исходное место
tr: Özgün konuma geri yüklenemedi
zh_hant: 無法放回原處

# detail.result.attention
source: 需要处理
ar: يحتاج إلى انتباه
de: Handlung nötig
en: Needs attention
es: Requiere atención
fr: Attention requise
ja: 要対応
ko: 조치 필요
pt: Precisa de atenção
ru: Требует внимания
tr: Dikkat gerektiriyor
zh_hant: 需要處理

# detail.result.partiallyDeleted.guidance
source: 删除中途失败，暂存对象里只剩一部分内容，不会被放回原路径。可在访达中按暂存名找到并自行删除。
ar: فشل الحذف في منتصف الطريق. يحتفظ الكائن المؤقت بجزء فقط ولن يُعاد إلى المسار الأصلي. اعثر عليه في Finder بالاسم المؤقت واحذفه بنفسك.
de: Löschen mittendrin fehlgeschlagen. Das Staging-Objekt enthält nur noch Teile und wird nicht zurückgelegt. Im Finder per Staging-Namen finden und selbst löschen.
en: Deletion failed mid-way. The staged object keeps only part of the content and won’t be restored to the original path. Find it in Finder by the staged name and remove it yourself.
es: La eliminación falló a medias. El objeto temporal solo conserva parte del contenido y no se restaurará. Búscalo en el Finder por el nombre temporal y elimínalo tú.
fr: La suppression a échoué en cours de route. L’objet de staging ne contient plus qu’une partie et ne sera pas restauré. Retrouvez-le dans le Finder via le nom de staging et supprimez-le.
ja: 削除が途中で失敗しました。ステージングオブジェクトには一部だけ残り、元のパスには戻りません。Finder でステージ名を探し、手動で削除してください。
ko: 삭제가 중간에 실패했습니다. 스테이징 객체에는 일부만 남아 원래 경로로 복원되지 않습니다. Finder에서 스테이징 이름으로 찾아 직접 삭제하세요.
pt: A exclusão falhou a meio. O objeto de staging ficou só com parte do conteúdo e não será restaurado. Encontre-o no Finder pelo nome de staging e apague-o.
ru: Удаление прервалось. В staging-объекте осталась лишь часть содержимого; на исходный путь он не вернётся. Найдите его в Finder по staging-имени и удалите вручную.
tr: Silme yarıda kesildi. Geçici nesne, içeriğin yalnızca bir kısmını içeriyor ve özgün yola geri yüklenmeyecek. Finder'da geçici adla bulup kendiniz silin.
zh_hant: 刪除中途失敗，暫存對象裡只剩一部分內容，不會被放回原路徑。可在訪達中按暫存名找到並自行刪除。

# detail.result.rollbackBlocked.guidance
source: 原路径已被重新创建，暂存对象未覆盖它。可在访达中按暂存名找到并自行处理。
ar: أُعيد إنشاء المسار الأصلي فلم يُرجَع الكائن المؤقت فوقه. اعثر عليه في Finder بالاسم المؤقت وعالجه بنفسك.
de: Der Originalpfad wurde neu angelegt, daher wurde das Staging-Objekt nicht darüber zurückgelegt. Im Finder per Staging-Namen finden und selbst behandeln.
en: The original path was recreated, so the staged object wasn’t put back over it. Find it in Finder by the staged name and handle it yourself.
es: Se recreó la ruta original, así que el objeto temporal no la sobrescribió. Búscalo en el Finder por el nombre temporal y gestionalo tú.
fr: Le chemin d’origine a été recréé ; l’objet de staging n’a donc pas été remis par-dessus. Retrouvez-le dans le Finder via le nom de staging et traitez-le.
ja: 元のパスが再作成されたため、ステージングオブジェクトは上書き復元されませんでした。Finder でステージ名を探し、手動で処理してください。
ko: 원래 경로가 다시 만들어져 스테이징 객체가 덮어쓰지 않았습니다. Finder에서 스테이징 이름으로 찾아 직접 처리하세요.
pt: O caminho original foi recriado, por isso o objeto de staging não o substituiu. Encontre-o no Finder pelo nome de staging e trate-o.
ru: Исходный путь был создан заново, поэтому staging-объект не вернули поверх него. Найдите его в Finder по staging-имени и обработайте вручную.
tr: Özgün yol yeniden oluşturulduğu için geçici nesne geri yerleştirilmedi. Finder'da geçici adla bulup kendiniz ilgilenin.
zh_hant: 原路徑已被重新創建，暫存對象未覆蓋它。可在訪達中按暫存名找到並自行處理。

# scanLog.purge.partialRoot
source: %@ 有子目录未能读取（%@），可能漏报部分产物
ar: كان لدى %@ مجلدات فرعية غير قابلة للقراءة (%@)؛ قد تُفوت بعض المخرجات
de: %@ hatte unlesbare Unterordner (%@); einige Artefakte fehlen möglicherweise
en: %@ had subfolders that couldn’t be read (%@); some artifacts may be missing
es: %@ tenía subcarpetas ilegibles (%@); pueden faltar algunos artefactos
fr: %@ contenait des sous-dossiers illisibles (%@) ; certains artefacts peuvent manquer
ja: %@ に読み取れないサブフォルダがあります（%@）。一部の成果物が漏れる可能性があります
ko: %@에 읽을 수 없는 하위 폴더가 있습니다(%@). 일부 산출물이 누락될 수 있습니다
pt: %@ tinha subpastas ilegíveis (%@); alguns artefactos podem faltar
ru: В %@ были нечитаемые подпапки (%@); часть артефактов могла не попасть в отчёт
tr: %@ içinde okunamayan alt klasörler vardı (%@); bazı yapıtlar eksik olabilir
zh_hant: %@ 有子目錄未能讀取（%@），可能漏報部分產物

# scanLog.missingTarget
source: 规则目录缺少 target %@，已跳过对应候选
ar: كتالوج القواعد يفتقد target %@؛ تم تخطي المرشحين المرتبطين
de: Regelkatalog fehlt target %@; zugehörige Kandidaten übersprungen
en: Rule catalog is missing target %@; related candidates were skipped
es: El catálogo de reglas no tiene el target %@; se omitieron candidatos relacionados
fr: Le catalogue de règles n’a pas le target %@ ; candidats associés ignorés
ja: ルールカタログに target %@ がありません。関連候補をスキップしました
ko: 규칙 카탈로그에 target %@가 없어 관련 후보를 건너뜀
pt: O catálogo de regras não tem o target %@; candidatos relacionados ignorados
ru: В каталоге правил нет target %@; связанные кандидаты пропущены
tr: Kural kataloğunda %@ hedefi eksik; ilgili adaylar atlandı
zh_hant: 規則目錄缺少 target %@，已跳過對應候選

# panel.action.trash
source: 移到废纸篓
ar: نقل إلى سلة المهملات
de: In den Papierkorb
en: Move to Trash
es: Mover a la Papelera
fr: Mettre à la corbeille
ja: ゴミ箱に入れる
ko: 휴지통으로 이동
pt: Mover para o Lixo
ru: Переместить в Корзину
tr: Çöp'e Taşı
zh_hant: 移到廢紙簍

# panel.action.trashSelected
source: 移到废纸篓 · %d 项 · 约 %@
ar: إلى سلة المهملات · %d عنصر · حوالي %@
de: In den Papierkorb · %d Elemente · ca. %@
en: Move to Trash · %d items · about %@
es: Mover a la Papelera · %d elementos · aprox. %@
fr: Mettre à la corbeille · %d éléments · env. %@
ja: ゴミ箱へ · %d 項目 · 約 %@
ko: 휴지통으로 · %d개 · 약 %@
pt: Mover para o Lixo · %d itens · cerca de %@
ru: В Корзину · %d элем. · ок. %@
tr: Çöp'e Taşı · %d öğe · yaklaşık %@
zh_hant: 移到廢紙簍 · %d 項 · 約 %@

# panel.action.cleanSelected
source: 清理 · %d 项 · 约 %@
ar: تنظيف · %d عنصر · حوالي %@
de: Bereinigen · %d Elemente · ca. %@
en: Clean · %d items · about %@
es: Limpiar · %d elementos · aprox. %@
fr: Nettoyer · %d éléments · env. %@
ja: クリーンアップ · %d 項目 · 約 %@
ko: 정리 · %d개 · 약 %@
pt: Limpar · %d itens · cerca de %@
ru: Очистить · %d элем. · ок. %@
tr: Temizle · %d öğe · yaklaşık %@
zh_hant: 清理 · %d 項 · 約 %@

# panel.action.confirmClean
source: 确认永久清理 %d 项 · 约 %@
ar: حذف %d عنصر نهائياً · حوالي %@
de: %d Elemente endgültig löschen · ca. %@
en: Permanently delete %d items · about %@
es: Eliminar permanentemente %d elementos · aprox. %@
fr: Supprimer définitivement %d éléments · env. %@
ja: %d 項目を完全削除 · 約 %@
ko: %d개 영구 삭제 · 약 %@
pt: Apagar permanentemente %d itens · cerca de %@
ru: Безвозвратно удалить %d элем. · ок. %@
tr: %d öğeyi kalıcı olarak sil · yaklaşık %@
zh_hant: 確認永久清理 %d 項 · 約 %@

# panel.action.confirmCleanFallback
source: 确认永久清理
ar: تأكيد التنظيف النهائي
de: Endgültige Bereinigung bestätigen
en: Confirm permanent cleanup
es: Confirmar limpieza permanente
fr: Confirmer le nettoyage définitif
ja: 完全クリーンアップの確認
ko: 영구 정리 확인
pt: Confirmar limpeza permanente
ru: Подтвердить безвозвратную очистку
tr: Kalıcı temizlemeyi onayla
zh_hant: 確認永久清理

# panel.action.cancelClean
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# panel.subtitle.scanning
source: 正在扫描 · %d 项，约 %@
ar: جارٍ المسح · %d عنصر، حوالي %@
de: Scan läuft · %d Elemente, ca. %@
en: Scanning · %d items, about %@
es: Escaneando · %d elementos, aprox. %@
fr: Analyse… · %d éléments, env. %@
ja: スキャン中 · %d 項目、約 %@
ko: 스캔 중 · %d개, 약 %@
pt: A escanear · %d itens, cerca de %@
ru: Сканирование · %d элем., ок. %@
tr: Taranıyor · %d öğe, yaklaşık %@
zh_hant: 正在掃描 · %d 項，約 %@

# panel.subtitle.limitedSuffix
source: （受限）
ar: (محدود)
de: (eingeschränkt)
en: (limited)
es: (limitado)
fr: (limité)
ja: （制限あり）
ko: (제한됨)
pt: (limitado)
ru: (ограничено)
tr: (sınırlı)

# panel.subtitle.confirming
source: 确认永久清理 %d 项 · 约 %@
ar: تأكيد التنظيف النهائي لـ %d عنصر · حوالي %@
de: Endgültige Bereinigung von %d Elementen bestätigen · ca. %@
en: Confirm permanent cleanup of %d items · about %@
es: Confirmar limpieza permanente de %d elementos · aprox. %@
fr: Confirmer le nettoyage définitif de %d éléments · env. %@
ja: %d 項目の完全削除を確認 · 約 %@
ko: %d개 영구 정리 확인 · 약 %@
pt: Confirmar limpeza permanente de %d itens · cerca de %@
ru: Подтвердить безвозвратную очистку %d элем. · ок. %@
tr: %d öğeyi kalıcı olarak temizlemeyi onayla · yaklaşık %@
zh_hant: 確認永久清理 %d 項 · 約 %@

# detail.purgeRoots.title
source: 扫描文件夹
ar: المجلدات للمسح
de: Zu scannende Ordner
en: Folders to scan
es: Carpetas a escanear
fr: Dossiers à analyser
ja: スキャンするフォルダ
ko: 스캔할 폴더
pt: Pastas a escanear
ru: Папки для сканирования
tr: Taranacak klasörler
zh_hant: 掃描文件夾

# detail.purgeRoots.description
source: 只扫描这些文件夹，最多向下 6 层。请添加具体工程目录，不要选择个人文件夹或系统目录。
ar: يُمسح فقط هذه المجلدات حتى عمق 6 مستويات. أضف مجلدات مشاريع محددة، وليس مجلد المنزل أو مواقع النظام.
de: Nur diese Ordner werden gescannt, maximal 6 Ebenen tief. Füge konkrete Projektordner hinzu – nicht deinen persönlichen Ordner oder Systemorte.
en: Only these folders are scanned, up to 6 levels deep. Add specific project directories—not your home folder or system locations.
es: Solo se escanean estas carpetas, hasta 6 niveles. Añade directorios de proyecto concretos, no tu carpeta de inicio ni ubicaciones del sistema.
fr: Seuls ces dossiers sont analysés, jusqu’à 6 niveaux. Ajoutez des répertoires de projet précis, pas votre dossier personnel ni des emplacements système.
ja: これらのフォルダのみを最大 6 階層までスキャンします。ホームやシステムではなく、具体的なプロジェクトディレクトリを追加してください。
ko: 이 폴더만 최대 6단계 깊이까지 스캔합니다. 홈이나 시스템 위치가 아닌 구체적인 프로젝트 디렉터리를 추가하세요.
pt: Só estas pastas são analisadas, até 6 níveis. Adicione diretórios de projeto específicos — não a pasta pessoal nem locais do sistema.
ru: Сканируются только эти папки, максимум 6 уровней. Добавляйте конкретные каталоги проектов, а не домашнюю папку или системные пути.
tr: Yalnızca bu klasörler, en fazla 6 düzey derinliğe kadar taranır. Belirli proje dizinleri ekleyin; ana klasörünüzü ya da sistem konumlarını eklemeyin.
zh_hant: 只掃描這些資料夾，最多向下 6 層。請新增具體專案目錄，不要選擇個人資料夾或系統目錄。

# detail.purgeRoots.add
source: 添加文件夹
ar: إضافة مجلد
de: Ordner hinzufügen
en: Add Folder
es: Añadir carpeta
fr: Ajouter un dossier
ja: フォルダを追加
ko: 폴더 추가
pt: Adicionar pasta
ru: Добавить папку
tr: Klasör Ekle
zh_hant: 添加文件夾

# detail.purgeRoots.remove
source: 移除此文件夹
ar: إزالة هذا المجلد
de: Diesen Ordner entfernen
en: Remove this folder
es: Quitar esta carpeta
fr: Retirer ce dossier
ja: このフォルダを削除
ko: 이 폴더 제거
pt: Remover esta pasta
ru: Удалить эту папку
tr: Bu klasörü kaldır
zh_hant: 移除此文件夾

# detail.purgeRoots.dismiss
source: 知道了
ar: حسنًا
de: Verstanden
en: Got It
es: Entendido
fr: Compris
ja: 了解
ko: 확인
pt: Entendi
ru: Понятно
tr: Anladım

# detail.purgeRoots.rejected.unresolvable
source: %@ 无法解析，可能已被移除或没有访问权限。
ar: تعذّر حل %@. ربما أُزيل أو ليس لديك إذن.
de: %@ konnte nicht aufgelöst werden. Möglicherweise entfernt oder kein Zugriff.
en: %@ couldn’t be resolved. It may have been removed or you don’t have access.
es: No se pudo resolver %@. Puede haberse eliminado o no tienes acceso.
fr: Impossible de résoudre %@. Il a peut‑être été supprimé ou l’accès est refusé.
ja: %@ を解決できません。削除されたか、アクセス権がない可能性があります。
ko: %@를 확인할 수 없습니다. 제거되었거나 접근 권한이 없을 수 있습니다.
pt: Não foi possível resolver %@. Pode ter sido removido ou sem permissão.
ru: Не удалось разрешить %@. Возможно, удалён или нет доступа.
tr: %@ çözümlenemedi. Kaldırılmış olabilir ya da erişim izniniz olmayabilir.
zh_hant: %@ 無法解析，可能已被移除或沒有訪問權限。

# detail.purgeRoots.rejected.duplicate
source: %@ 已经在列表里了。
ar: %@ موجود بالفعل في القائمة.
de: %@ ist bereits in der Liste.
en: %@ is already in the list.
es: %@ ya está en la lista.
fr: %@ est déjà dans la liste.
ja: %@ はすでにリストにあります。
ko: %@는 이미 목록에 있습니다.
pt: %@ já está na lista.
ru: %@ уже есть в списке.
tr: %@ zaten listede.
zh_hant: %@ 已經在列表裡了。

# detail.purgeRoots.rejected.covered
source: %@ 已包含在 %@ 之内，无需重复添加。
ar: %@ مُضمَّن بالفعل ضمن %@. لا حاجة لإضافته مجددًا.
de: %@ ist bereits in %@ enthalten. Kein erneutes Hinzufügen nötig.
en: %@ is already covered by %@. No need to add it again.
es: %@ ya está cubierto por %@. No hace falta añadirlo de nuevo.
fr: %@ est déjà couvert par %@. Pas besoin de l’ajouter à nouveau.
ja: %@ はすでに %@ に含まれています。追加する必要はありません。
ko: %@는 이미 %@에 포함되어 있습니다. 다시 추가할 필요 없습니다.
pt: %@ já está coberto por %@. Não é preciso adicionar de novo.
ru: %@ уже входит в %@. Повторно добавлять не нужно.
tr: %@, %@ içinde zaten bulunuyor. Yeniden eklemenize gerek yok.
zh_hant: %@ 已包含在 %@ 之內，無需重複添加。

# detail.purgeRoots.choose
source: 选择
ar: اختيار
de: Auswählen
en: Choose
es: Elegir
fr: Choisir
ja: 選択
ko: 선택
pt: Escolher
ru: Выбрать
tr: Seç
zh_hant: 選擇

# detail.purgeRoots.chooseMessage
source: 选择具体的工程文件夹（不要选个人文件夹或系统目录）
ar: اختر مجلد مشروع محددًا (وليس مجلد المنزل أو موقعًا نظاميًا)
de: Wähle einen konkreten Projektordner (nicht persönlichen Ordner oder Systemorte)
en: Choose a specific project folder (not your home folder or a system location)
es: Elige una carpeta de proyecto concreta (no tu inicio ni una ubicación del sistema)
fr: Choisissez un dossier de projet précis (pas votre dossier personnel ni un emplacement système)
ja: 具体的なプロジェクトフォルダを選択してください（ホームやシステム場所は不可）
ko: 구체적인 프로젝트 폴더를 선택하세요(홈이나 시스템 위치는 안 됨)
pt: Escolha uma pasta de projeto específica (não a pasta pessoal nem um local do sistema)
ru: Выберите конкретную папку проекта (не домашнюю и не системную)
tr: Belirli bir proje klasörü seçin (ana klasörünüzü ya da bir sistem konumunu değil)
zh_hant: 選擇具體的專案資料夾（不要選個人資料夾或系統目錄）

# scanLog.expandTarget
source: 展开 %@：匹配 %d 项
ar: توسيع %@: %d تطابقات
de: %@ erweitern: %d Treffer
en: Expand %@: %d matches
es: Expandir %@: %d coincidencias
fr: Expansion de %@ : %d correspondances
ja: %@ を展開：%d 件一致
ko: %@ 확장: %d개 일치
pt: Expandir %@: %d correspondências
ru: Развернуть %@: %d совпадений
tr: %@ genişletiliyor: %d eşleşme
zh_hant: 展開 %@：匹配 %d 項

# scanLog.targetFailed
source: 展开失败：%@（%@）
ar: فشل التوسيع: %@ (%@)
de: Erweitern fehlgeschlagen: %@ (%@)
en: Expand failed: %@ (%@)
es: Error al expandir: %@ (%@)
fr: Échec de l’expansion : %@ (%@)
ja: 展開失敗：%@（%@）
ko: 확장 실패: %@(%@)
pt: Falha ao expandir: %@ (%@)
ru: Сбой развёртывания: %@ (%@)
tr: Genişletme başarısız oldu: %@ (%@)
zh_hant: 展開失敗：%@（%@）

# scanLog.limitation.fda
source: 未开启完全磁盘访问，已跳过 %d 项规则
ar: الوصول الكامل إلى القرص معطّل — تم تخطي %d قاعدة
de: Vollzugriff aus — %d Regeln übersprungen
en: Full Disk Access is off — skipped %d rules
es: Acceso total al disco desactivado: se omitieron %d reglas
fr: Accès complet au disque désactivé — %d règles ignorées
ja: フルディスクアクセスがオフのため、%d 件のルールをスキップ
ko: 전체 디스크 접근이 꺼져 규칙 %d개를 건너뜀
pt: Acesso Total ao Disco desligado — %d regras ignoradas
ru: Полный доступ к диску выключен — пропущено %d правил
tr: Tam Disk Erişimi kapalı — %d kural atlandı
zh_hant: 未開啟完全磁碟存取，已跳過 %d 項規則

# scanLog.limitation.dynamicFailed
source: 动态规则失败：%@（%@）
ar: فشل القاعدة الديناميكية: %@ (%@)
de: Dynamische Regel fehlgeschlagen: %@ (%@)
en: Dynamic rule failed: %@ (%@)
es: Regla dinámica fallida: %@ (%@)
fr: Échec de la règle dynamique : %@ (%@)
ja: 動的ルール失敗：%@（%@）
ko: 동적 규칙 실패: %@(%@)
pt: Regra dinâmica falhou: %@ (%@)
ru: Динамическое правило сбой: %@ (%@)
tr: Dinamik kural başarısız oldu: %@ (%@)
zh_hant: 動態規則失敗：%@（%@）

# scanLog.limitation.expansionFailed
source: 规则展开失败：%@（%@）
ar: فشل توسيع القاعدة: %@ (%@)
de: Regelerweiterung fehlgeschlagen: %@ (%@)
en: Rule expansion failed: %@ (%@)
es: Expansión de regla fallida: %@ (%@)
fr: Échec de l’expansion de règle : %@ (%@)
ja: ルール展開失敗：%@（%@）
ko: 규칙 확장 실패: %@(%@)
pt: Falha na expansão da regra: %@ (%@)
ru: Сбой развёртывания правила: %@ (%@)
tr: Kural genişletmesi başarısız oldu: %@ (%@)
zh_hant: 規則展開失敗：%@（%@）

# scanLog.limitation.volumeSkipped
source: 已跳过不支持的卷：%@
ar: تم تخطي مجلد غير مدعوم: %@
de: Nicht unterstütztes Volume übersprungen: %@
en: Skipped unsupported volume: %@
es: Volumen no compatible omitido: %@
fr: Volume non pris en charge ignoré : %@
ja: 未対応ボリュームをスキップ：%@
ko: 지원되지 않는 볼륨 건너뜀: %@
pt: Volume sem suporte ignorado: %@
ru: Пропущен неподдерживаемый том: %@
tr: Desteklenmeyen birim atlandı: %@
zh_hant: 已跳過不支持的卷：%@

# scanLog.limitation.scanRootUnreadable
source: 无法读取 %@（%@）
ar: تعذّرت قراءة %@ (%@)
de: %@ konnte nicht gelesen werden (%@)
en: Couldn’t read %@ (%@)
es: No se pudo leer %@ (%@)
fr: Impossible de lire %@ (%@)
ja: %@ を読み取れません（%@）
ko: %@를 읽을 수 없음(%@)
pt: Não foi possível ler %@ (%@)
ru: Не удалось прочитать %@ (%@)
tr: %@ okunamadı (%@)
zh_hant: 無法讀取 %@（%@）

# scanLog.limitation.circuitBroken
source: 扫描引擎已降级，重启应用恢复
ar: محرك المسح متراجع — أعد تشغيل التطبيق للاستعادة
de: Scan-Engine im Notbetrieb — App neu starten
en: Scan engine degraded — restart the app to recover
es: Motor de escaneo degradado: reinicia la app
fr: Moteur d’analyse dégradé — redémarrez l’app
ja: スキャンエンジンが縮退 — アプリを再起動して復旧
ko: 스캔 엔진 저하 — 앱을 재시작해 복구
pt: Motor de varredura degradado — reinicie a app
ru: Движок сканирования в урезанном режиме — перезапустите приложение
tr: Tarama motoru düşük performans modunda — düzelmek için uygulamayı yeniden başlatın
zh_hant: 掃描引擎已降級，重啟應用恢復

# scanLog.limitation.threadsAbandoned
source: %d 个扫描线程无响应已被放弃
ar: تم التخلي عن %d من خيوط المسح غير المستجيبة
de: %d nicht reagierende Scan-Threads verworfen
en: %d scan threads unresponsive and abandoned
es: %d hilos de escaneo sin respuesta abandonados
fr: %d fils d’analyse sans réponse abandonnés
ja: 応答しないスキャンスレッド %d 個を放棄
ko: 응답 없는 스캔 스레드 %d개 포기
pt: %d threads de varredura sem resposta abandonadas
ru: %d неотвечающих потоков сканирования отброшены
tr: %d tarama iş parçacığı yanıt vermediği için bırakıldı
zh_hant: %d 個掃描線程無響應已被放棄

# detail.developerArtifacts.needsRoots
source: 先添加要扫描的工程文件夹，只会扫描你指定的目录
ar: أضف مجلدات المشاريع للمسح. يُمسح فقط ما تختاره.
de: Projektordner zum Scannen hinzufügen. Es werden nur von dir gewählte Ordner gescannt.
en: Add project folders to scan. Only the folders you choose are scanned.
es: Añade carpetas de proyecto para escanear. Solo se escanean las que elijas.
fr: Ajoutez des dossiers de projet à analyser. Seuls les dossiers choisis sont parcourus.
ja: スキャンするプロジェクトフォルダを追加します。指定したフォルダだけが対象です。
ko: 스캔할 프로젝트 폴더를 추가하세요. 지정한 폴더만 스캔합니다.
pt: Adicione pastas de projeto para escanear. Só as pastas escolhidas são analisadas.
ru: Добавьте папки проектов для сканирования. Сканируются только выбранные вами.
tr: Taramak için proje klasörleri ekleyin. Yalnızca seçtiğiniz klasörler taranır.
zh_hant: 先添加要掃描的工程文件夾，只會掃描你指定的目錄

# detail.section.notScanned
source: 点击「扫描」查看可清理内容
ar: انقر «مسح» لعرض ما يمكن تنظيفه
de: „Scannen“ tippen, um bereinigbare Inhalte zu sehen
en: Click Scan to see what can be cleaned
es: Pulsa Escanear para ver lo que se puede limpiar
fr: Cliquez sur Analyser pour voir ce qui peut être nettoyé
ja: 「スキャン」を押してクリーンアップ可能な項目を表示
ko: 「스캔」을 눌러 정리 가능한 항목 확인
pt: Clique em Escanear para ver o que pode ser limpo
ru: Нажмите «Сканировать», чтобы увидеть, что можно очистить
tr: Nelerin temizlenebileceğini görmek için Tara düğmesini tıklayın
zh_hant: 點擊「掃描」查看可清理內容

# detail.section.accessDenied.title
source: 没有访问权限，无法确认里面有什么
ar: لا يوجد وصول — يتعذّر تأكيد المحتوى
de: Kein Zugriff — Inhalt nicht prüfbar
en: No access — can’t confirm what’s inside
es: Sin acceso: no se puede confirmar el contenido
fr: Pas d’accès — impossible de confirmer le contenu
ja: アクセス権がないため内容を確認できません
ko: 접근 권한 없음 — 내용을 확인할 수 없음
pt: Sem acesso — não é possível confirmar o conteúdo
ru: Нет доступа — содержимое не подтвердить
tr: Erişim yok — içindekiler doğrulanamıyor
zh_hant: 沒有訪問權限，無法確認裡面有什麼

# detail.section.accessDenied.message
source: 系统拒绝了对 %@ 的访问。在系统设置里允许后重新扫描。
ar: رفض النظام الوصول إلى %@. اسمح به في إعدادات النظام ثم أعد المسح.
de: Das System hat den Zugriff auf %@ verweigert. In den Systemeinstellungen erlauben und erneut scannen.
en: The system denied access to %@. Allow access in System Settings, then scan again.
es: El sistema denegó el acceso a %@. Permítelo en Ajustes del Sistema y vuelve a escanear.
fr: Le système a refusé l’accès à %@. Autorisez-le dans Réglages Système, puis analysez à nouveau.
ja: システムが %@ へのアクセスを拒否しました。システム設定で許可してから再スキャンしてください。
ko: 시스템이 %@에 대한 접근을 거부했습니다. 시스템 설정에서 허용한 뒤 다시 스캔하세요.
pt: O sistema negou o acesso a %@. Permita em Ajustes do Sistema e escaneie de novo.
ru: Система отказала в доступе к %@. Разрешите в «Системных настройках» и просканируйте снова.
tr: Sistem, %@ için erişimi reddetti. Sistem Ayarları'nda erişime izin verin, ardından yeniden tarayın.
zh_hant: 系統拒絕了對 %@ 的訪問。在系統設置裡允許後重新掃描。
